In [1]:
import matplotlib.pyplot as plt 
import pandas as pd
import numpy as np

C:\Users\CHAITANYA\AppData\Local\Temp\ipykernel_16084\3201931906.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
Dataset = pd.read_csv("Titanic-Dataset.csv")

In [3]:
Dataset

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [2]:
Dataset=Dataset.drop(columns=['PassengerId','Name','Ticket','Cabin'])

NameError: name 'Dataset' is not defined

In [ ]:
Dataset

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0           0       3    male  22.0      1      0   7.2500        S
1           1       1  female  38.0      1      0  71.2833        C
2           1       3  female  26.0      0      0   7.9250        S
3           1       1  female  35.0      1      0  53.1000        S
4           0       3    male  35.0      0      0   8.0500        S
..        ...     ...     ...   ...    ...    ...      ...      ...
886         0       2    male  27.0      0      0  13.0000        S
887         1       1  female  19.0      0      0  30.0000        S
888         0       3  female   NaN      1      2  23.4500        S
889         1       1    male  26.0      0      0  30.0000        C
890         0       3    male  32.0      0      0   7.7500        Q

[891 rows x 8 columns]

In [ ]:
Dataset.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [ ]:
med = Dataset['Age'].median()

In [ ]:
Dataset['Age']=Dataset['Age'].fillna(med)

In [ ]:
maxi = Dataset['Embarked'].value_counts().idxmax()

In [ ]:
Dataset['Embarked']=Dataset['Embarked'].fillna(maxi)

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

In [ ]:
Dataset=pd.get_dummies(Dataset,columns=['Embarked','Sex'])
Dataset

,Survived,Pclass,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S,Sex_female,Sex_male
0,0,3,22.0,1,0,7.2500,0,0,1,0,1
1,1,1,38.0,1,0,71.2833,1,0,0,1,0
2,1,3,26.0,0,0,7.9250,0,0,1,1,0
3,1,1,35.0,1,0,53.1000,0,0,1,1,0
4,0,3,35.0,0,0,8.0500,0,0,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,27.0,0,0,13.0000,0,0,1,0,1
887,1,1,19.0,0,0,30.0000,0,0,1,1,0
888,0,3,28.0,1,2,23.4500,0,0,1,1,0
889,1,1,26.0,0,0,30.0000,1,0,0,0,1
890,0,3,32.0,0,0,7.7500,0,1,0,0,1

In [ ]:
y = pd.DataFrame(Dataset['Survived'], columns=['Survived'])

In [ ]:
x= Dataset.drop(columns=['Survived'])

In [ ]:
x.head()

,Pclass,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S,Sex_female,Sex_male
0,3,22.0,1,0,7.2500,0,0,1,0,1
1,1,38.0,1,0,71.2833,1,0,0,1,0
2,3,26.0,0,0,7.9250,0,0,1,1,0
3,1,35.0,1,0,53.1000,0,0,1,1,0
4,3,35.0,0,0,8.0500,0,0,1,0,1

In [ ]:
x.shape

(891, 10)

In [ ]:
y.head()

   Survived
0         0
1         1
2         1
3         1
4         0

In [ ]:
y.shape

(891, 1)

In [ ]:
from sklearn.model_selection import train_test_split

In [ ]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2,random_state=69)

In [ ]:
x_train.shape

(712, 10)

In [ ]:
x_test.shape

(179, 10)

In [ ]:
from sklearn.linear_model import LogisticRegression

In [ ]:
model = LogisticRegression()

In [ ]:
model.fit(x_train,y_train)

C:\Users\Deepa\anaconda3\lib\site-packages\sklearn\utils\validation.py:993: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
C:\Users\Deepa\anaconda3\lib\site-packages\sklearn\linear_model\_logistic.py:814: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression()

In [3]:
pred = model.predict(x_test)

NameError: name 'model' is not defined

In [50]:
from sklearn.metrics import f1_score, recall_score, precision_score

In [51]:
print((f1_score(y_test, pred))*100, "%")

73.6842105263158 %

In [52]:
print((recall_score(y_test, pred)))

0.7313432835820896

In [53]:
print((precision_score(y_test, pred)))

0.7424242424242424

In [54]:
from sklearn.preprocessing import StandardScaler

In [55]:
scaler = StandardScaler()

x_train_scaler = scaler.fit_transform(x_train)

x_test_scaler = scaler.transform(x_test)

In [56]:
model.fit(x_train,y_train)

C:\Users\Deepa\anaconda3\lib\site-packages\sklearn\utils\validation.py:993: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
C:\Users\Deepa\anaconda3\lib\site-packages\sklearn\linear_model\_logistic.py:814: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression()

In [57]:
pred = model.predict(x_test)

In [58]:
print((f1_score(y_test, pred))*100, "%")

73.6842105263158 %

In [65]:
x=Dataset.drop(columns=['Parch'])
x

,Survived,Pclass,Age,SibSp,Fare,Embarked_C,Embarked_Q,Embarked_S,Sex_female,Sex_male
0,0,3,22.0,1,7.2500,0,0,1,0,1
1,1,1,38.0,1,71.2833,1,0,0,1,0
2,1,3,26.0,0,7.9250,0,0,1,1,0
3,1,1,35.0,1,53.1000,0,0,1,1,0
4,0,3,35.0,0,8.0500,0,0,1,0,1
...,...,...,...,...,...,...,...,...,...,...
886,0,2,27.0,0,13.0000,0,0,1,0,1
887,1,1,19.0,0,30.0000,0,0,1,1,0
888,0,3,28.0,1,23.4500,0,0,1,1,0
889,1,1,26.0,0,30.0000,1,0,0,0,1
890,0,3,32.0,0,7.7500,0,1,0,0,1

In [66]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2,random_state=69)

In [67]:
model.fit(x_train,y_train)

C:\Users\Deepa\anaconda3\lib\site-packages\sklearn\utils\validation.py:993: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
C:\Users\Deepa\anaconda3\lib\site-packages\sklearn\linear_model\_logistic.py:814: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression()

In [68]:
pred = model.predict(x_test)

In [69]:
print((f1_score(y_test, pred))*100, "%")

100.0 %

In [70]:
print((recall_score(y_test, pred)))

1.0